ai-agents/reports/artifacts/20260508-m10-full-k6-load-test-execution-qa/k6-run-baseline.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /scripts/customer-stock-search.js
        output: -

     scenarios: (100.00%) 1 scenario, 2 max VUs, 40s max duration (incl. graceful stop):
              * default: 2 looping VUs for 10s (gracefulStop: 30s)


running (01.0s), 2/2 VUs, 0 complete and 0 interrupted iterations
default   [  10% ] 2 VUs  01.0s/10s

running (02.0s), 2/2 VUs, 2 complete and 0 interrupted iterations
default   [  20% ] 2 VUs  02.0s/10s

running (03.0s), 2/2 VUs, 4 complete and 0 interrupted iterations
default   [  30% ] 2 VUs  03.0s/10s

running (04.0s), 2/2 VUs, 6 complete and 0 interrupted iterations
default   [  40% ] 2 VUs  04.0s/10s

running (05.0s), 2/2 VUs, 8 complete and 0 interrupted iterations
default   [  50% ] 2 VUs  05.0s/10s

running (06.0s), 2/2 VUs, 10 complete and 0 interrupted iterations
default   [  60% ] 2 VUs  06.0s/10s

running (07.0s), 2/2 VUs, 12 complete and 0 interrupted iterations
default   [  70% ] 2 VUs  07.0s/10s

running (08.0s), 2/2 VUs, 14 complete and 0 interrupted iterations
default   [  80% ] 2 VUs  08.0s/10s

running (09.0s), 2/2 VUs, 16 complete and 0 interrupted iterations
default   [  90% ] 2 VUs  09.0s/10s

running (10.0s), 2/2 VUs, 18 complete and 0 interrupted iterations
default ↓ [ 100% ] 2 VUs  10s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<500' p(95)=52.09ms

    http_req_failed
    ✓ 'rate<0.05' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 20      1.916014/s
    checks_succeeded...: 100.00% 20 out of 20
    checks_failed......: 0.00%   0 out of 20

    ✓ stock search returns ok

    HTTP
    http_req_duration..............: avg=37.73ms min=21.91ms med=36.55ms max=71.78ms p(90)=45.61ms p(95)=52.09ms
      { expected_response:true }...: avg=37.73ms min=21.91ms med=36.55ms max=71.78ms p(90)=45.61ms p(95)=52.09ms
    http_req_failed................: 0.00%  0 out of 20
    http_reqs......................: 20     1.916014/s

    EXECUTION
    iteration_duration.............: avg=1.04s   min=1.02s   med=1.04s   max=1.07s   p(90)=1.05s   p(95)=1.05s  
    iterations.....................: 20     1.916014/s
    vus............................: 2      min=2       max=2
    vus_max........................: 2      min=2       max=2

    NETWORK
    data_received..................: 11 kB  1.0 kB/s
    data_sent......................: 2.9 kB 282 B/s



running (10.4s), 0/2 VUs, 20 complete and 0 interrupted iterations
default ✓ [ 100% ] 2 VUs  10s

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /scripts/concurrent-booking-same-stock.js
        output: -

     scenarios: (100.00%) 1 scenario, 2 max VUs, 10m30s max duration (incl. graceful stop):
              * default: 6 iterations shared among 2 VUs (maxDuration: 10m0s, gracefulStop: 30s)



  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<750' p(95)=62.75ms

    http_req_failed
    ✓ 'rate<0.05' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 6       8.037713/s
    checks_succeeded...: 100.00% 6 out of 6
    checks_failed......: 0.00%   0 out of 6

    ✓ booking returns success or contention status

    HTTP
    http_req_duration..............: avg=40.4ms   min=29.52ms  med=35.19ms  max=69.78ms p(90)=55.73ms p(95)=62.75ms
      { expected_response:true }...: avg=40.4ms   min=29.52ms  med=35.19ms  max=69.78ms p(90)=55.73ms p(95)=62.75ms
    http_req_failed................: 0.00%  0 out of 6
    http_reqs......................: 6      8.037713/s

    EXECUTION
    iteration_duration.............: avg=244.26ms min=232.14ms med=237.89ms max=274.9ms p(90)=262.1ms p(95)=268.5ms
    iterations.....................: 6      8.037713/s

    NETWORK
    data_received..................: 2.6 kB 3.5 kB/s
    data_sent......................: 2.2 kB 3.0 kB/s



running (00m00.7s), 0/2 VUs, 6 complete and 0 interrupted iterations
default ✓ [ 100% ] 2 VUs  00m00.7s/10m0s  6/6 shared iters

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /scripts/checkout-wallet-consistency.js
        output: -

     scenarios: (100.00%) 1 scenario, 2 max VUs, 10m30s max duration (incl. graceful stop):
              * default: 6 iterations shared among 2 VUs (maxDuration: 10m0s, gracefulStop: 30s)


running (00m01.0s), 2/2 VUs, 2 complete and 0 interrupted iterations
default   [  33% ] 2 VUs  00m01.0s/10m0s  2/6 shared iters


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<1000' p(95)=72.13ms

    http_req_failed
    ✓ 'rate<0.05' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 6       3.641172/s
    checks_succeeded...: 100.00% 6 out of 6
    checks_failed......: 0.00%   0 out of 6

    ✓ checkout returns success or consistency conflict

    HTTP
    http_req_duration..............: avg=41.85ms  min=23.87ms  med=33.89ms  max=79.35ms  p(90)=64.91ms  p(95)=72.13ms 
      { expected_response:true }...: avg=41.85ms  min=23.87ms  med=33.89ms  max=79.35ms  p(90)=64.91ms  p(95)=72.13ms 
    http_req_failed................: 0.00%  0 out of 6
    http_reqs......................: 6      3.641172/s

    EXECUTION
    iteration_duration.............: avg=544.84ms min=527.87ms med=536.41ms max=581.31ms p(90)=566.99ms p(95)=574.15ms
    iterations.....................: 6      3.641172/s
    vus............................: 2      min=2      max=2
    vus_max........................: 2      min=2      max=2

    NETWORK
    data_received..................: 2.5 kB 1.5 kB/s
    data_sent......................: 2.1 kB 1.3 kB/s



running (00m01.6s), 0/2 VUs, 6 complete and 0 interrupted iterations
default ✓ [ 100% ] 2 VUs  00m01.6s/10m0s  6/6 shared iters

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /scripts/partner-tenant-burst-sync.js
        output: -

     scenarios: (100.00%) 1 scenario, 2 max VUs, 40s max duration (incl. graceful stop):
              * default: 2 looping VUs for 10s (gracefulStop: 30s)


running (01.0s), 2/2 VUs, 8 complete and 0 interrupted iterations
default   [  10% ] 2 VUs  01.0s/10s

running (02.0s), 2/2 VUs, 16 complete and 0 interrupted iterations
default   [  20% ] 2 VUs  02.0s/10s

running (03.0s), 2/2 VUs, 24 complete and 0 interrupted iterations
default   [  30% ] 2 VUs  03.0s/10s

running (04.0s), 2/2 VUs, 33 complete and 0 interrupted iterations
default   [  40% ] 2 VUs  04.0s/10s

running (05.0s), 2/2 VUs, 42 complete and 0 interrupted iterations
default   [  50% ] 2 VUs  05.0s/10s

running (06.0s), 2/2 VUs, 50 complete and 0 interrupted iterations
default   [  60% ] 2 VUs  06.0s/10s

running (07.0s), 2/2 VUs, 58 complete and 0 interrupted iterations
default   [  70% ] 2 VUs  07.0s/10s

running (08.0s), 2/2 VUs, 66 complete and 0 interrupted iterations
default   [  80% ] 2 VUs  08.0s/10s

running (09.0s), 2/2 VUs, 74 complete and 0 interrupted iterations
default   [  90% ] 2 VUs  09.0s/10s

running (10.0s), 2/2 VUs, 83 complete and 0 interrupted iterations
default   [ 100% ] 2 VUs  10.0s/10s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<1000' p(95)=47.75ms

    http_req_failed
    ✓ 'rate<0.05' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 85      8.305452/s
    checks_succeeded...: 100.00% 85 out of 85
    checks_failed......: 0.00%   0 out of 85

    ✓ partner sync batch accepted

    HTTP
    http_req_duration..............: avg=34.01ms min=20.8ms   med=34.07ms  max=51.79ms  p(90)=43.19ms  p(95)=47.75ms 
      { expected_response:true }...: avg=34.01ms min=20.8ms   med=34.07ms  max=51.79ms  p(90)=43.19ms  p(95)=47.75ms 
    http_req_failed................: 0.00% 0 out of 85
    http_reqs......................: 85    8.305452/s

    EXECUTION
    iteration_duration.............: avg=238.1ms min=223.28ms med=238.53ms max=254.07ms p(90)=248.66ms p(95)=252.23ms
    iterations.....................: 85    8.305452/s
    vus............................: 2     min=2       max=2
    vus_max........................: 2     min=2       max=2

    NETWORK
    data_received..................: 24 kB 2.3 kB/s
    data_sent......................: 61 kB 6.0 kB/s



running (10.2s), 0/2 VUs, 85 complete and 0 interrupted iterations
default ✓ [ 100% ] 2 VUs  10s

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /scripts/reward-publish-spike.js
        output: -

     scenarios: (100.00%) 1 scenario, 2 max VUs, 40s max duration (incl. graceful stop):
              * default: 2 looping VUs for 10s (gracefulStop: 30s)


running (01.0s), 2/2 VUs, 2 complete and 0 interrupted iterations
default   [  10% ] 2 VUs  01.0s/10s

running (02.0s), 2/2 VUs, 6 complete and 0 interrupted iterations
default   [  20% ] 2 VUs  02.0s/10s

running (03.0s), 2/2 VUs, 10 complete and 0 interrupted iterations
default   [  30% ] 2 VUs  03.0s/10s

running (04.0s), 2/2 VUs, 14 complete and 0 interrupted iterations
default   [  40% ] 2 VUs  04.0s/10s

running (05.0s), 2/2 VUs, 18 complete and 0 interrupted iterations
default   [  50% ] 2 VUs  05.0s/10s

running (06.0s), 2/2 VUs, 22 complete and 0 interrupted iterations
default   [  60% ] 2 VUs  06.0s/10s

running (07.0s), 2/2 VUs, 26 complete and 0 interrupted iterations
default   [  70% ] 2 VUs  07.0s/10s

running (08.0s), 2/2 VUs, 28 complete and 0 interrupted iterations
default   [  80% ] 2 VUs  08.0s/10s

running (09.0s), 2/2 VUs, 32 complete and 0 interrupted iterations
default   [  90% ] 2 VUs  09.0s/10s

running (10.0s), 2/2 VUs, 36 complete and 0 interrupted iterations
default ↓ [ 100% ] 2 VUs  10s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<500' p(95)=41.15ms

    http_req_failed
    ✓ 'rate<0.05' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 38      3.729489/s
    checks_succeeded...: 100.00% 38 out of 38
    checks_failed......: 0.00%   0 out of 38

    ✓ published reward result returns ok

    HTTP
    http_req_duration..............: avg=30.56ms  min=18.92ms  med=29.53ms  max=61.9ms   p(90)=38.54ms  p(95)=41.15ms 
      { expected_response:true }...: avg=30.56ms  min=18.92ms  med=29.53ms  max=61.9ms   p(90)=38.54ms  p(95)=41.15ms 
    http_req_failed................: 0.00%  0 out of 38
    http_reqs......................: 38     3.729489/s

    EXECUTION
    iteration_duration.............: avg=535.43ms min=520.68ms med=534.49ms max=563.85ms p(90)=542.11ms p(95)=547.52ms
    iterations.....................: 38     3.729489/s
    vus............................: 2      min=2       max=2
    vus_max........................: 2      min=2       max=2

    NETWORK
    data_received..................: 19 kB  1.9 kB/s
    data_sent......................: 4.6 kB 448 B/s



running (10.2s), 0/2 VUs, 38 complete and 0 interrupted iterations
default ✓ [ 100% ] 2 VUs  10s

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /scripts/reward-checking-queue-chunk.js
        output: -

     scenarios: (100.00%) 1 scenario, 2 max VUs, 10m30s max duration (incl. graceful stop):
              * default: 6 iterations shared among 2 VUs (maxDuration: 10m0s, gracefulStop: 30s)


running (00m01.0s), 2/2 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 2 VUs  00m01.0s/10m0s  0/6 shared iters

running (00m02.0s), 2/2 VUs, 2 complete and 0 interrupted iterations
default   [  33% ] 2 VUs  00m02.0s/10m0s  2/6 shared iters

running (00m03.0s), 2/2 VUs, 4 complete and 0 interrupted iterations
default   [  67% ] 2 VUs  00m03.0s/10m0s  4/6 shared iters


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<1500' p(95)=57.25ms

    http_req_failed
    ✓ 'rate<0.05' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 6       1.903614/s
    checks_succeeded...: 100.00% 6 out of 6
    checks_failed......: 0.00%   0 out of 6

    ✓ reward check batch read is available to central admin

    HTTP
    http_req_duration..............: avg=40.62ms min=26.66ms med=39.12ms max=59.92ms p(90)=54.58ms p(95)=57.25ms
      { expected_response:true }...: avg=40.62ms min=26.66ms med=39.12ms max=59.92ms p(90)=54.58ms p(95)=57.25ms
    http_req_failed................: 0.00%  0 out of 6
    http_reqs......................: 6      1.903614/s

    EXECUTION
    iteration_duration.............: avg=1.04s   min=1.03s   med=1.04s   max=1.06s   p(90)=1.06s   p(95)=1.06s  
    iterations.....................: 6      1.903614/s
    vus............................: 2      min=2      max=2
    vus_max........................: 2      min=2      max=2

    NETWORK
    data_received..................: 3.3 kB 1.1 kB/s
    data_sent......................: 1.6 kB 503 B/s



running (00m03.2s), 0/2 VUs, 6 complete and 0 interrupted iterations
default ✓ [ 100% ] 2 VUs  00m03.2s/10m0s  6/6 shared iters
k6 summaries written to /Users/supakit/WorkSpace/www/newPaotang/load-tests/results/20260508T072215Z